<a href="https://colab.research.google.com/github/werowe/HypatiaAcademy/blob/master/class/2024_10_11_Homework.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [9]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [10]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [11]:
%sql sqlite:////content/drive/MyDrive/parent_table.db/

In [12]:
%sql PRAGMA foreign_keys = ON;

 * sqlite:////content/drive/MyDrive/parent_table.db/
Done.

[]

In [55]:
#CREATE THE PARENT TABLE

#import the library
import sqlite3

#define the path
db_path = '/content/drive/MyDrive/parent_table.db'

#connect to the database
conn = sqlite3.connect(db_path)

#put on the keys
conn.execute('PRAGMA foreign_keys = ON')

#create the table
create_parent_table = '''
CREATE TABLE IF NOT EXISTS parent (
    parent_id INTEGER PRIMARY KEY AUTOINCREMENT,
    parent_name TEXT,
    parent_dob TEXT,
    phone_number INTEGER
)
'''

#execute the SQL statement
conn.execute(create_parent_table)

#save
conn.commit()

In [56]:
generateChildSQL(conn)

"INSERT INTO child (parent_id, child_name, date_created) VALUES (78,'Anastasia Kovalenko', '1999-11-07')"

In [57]:
getRandomParent(conn)

66

In [58]:
cursor = conn.cursor()

sql="select parent_id from parent"

cursor.execute(sql)

accounts=cursor.fetchall()

#return accounts[random.randint(0,len(accounts)-1)][0]

In [62]:
 accounts[random.randint(0,len(accounts)-1)][0]

73

In [61]:
t=(66,)

In [59]:
accounts

[(66,),
 (67,),
 (68,),
 (69,),
 (70,),
 (71,),
 (72,),
 (73,),
 (74,),
 (75,),
 (76,),
 (77,),
 (78,),
 (79,),
 (80,)]

In [51]:
def getRandomParent(conn):


  cursor = conn.cursor()

  sql="select parent_id from parent"

  cursor.execute(sql)

  accounts=cursor.fetchall()

  return accounts[random.randint(0,len(accounts)-1)][0]


def generateChildSQL(conn):

  dt=getDate()
  parent_id = getRandomParent(conn)

  name=getName()

  sql="INSERT INTO child (parent_id, child_name, date_created) VALUES ({},'{}', '{}')".format( parent_id,name, dt)


  return sql

In [46]:
%%sql
select parent_id from parent

 * sqlite:////content/drive/MyDrive/parent_table.db/
Done.

[]

In [14]:
#ADD RANDOM DATA

#library needed
import random

#get a random name
#define the function
def getName():
    fnames = ["Oleg", "Diana", "Kate", "Yulia", "Mark", "Vlad", "Anastasia"] #first names
    lnames = ["Zelensky", "Kovalenko", "Kravchenko", "Hrytsenko", "Melnyk"] #last names

    return fnames[random.randint(0, len(fnames)-1)] +  " " + lnames[random.randint(0, len(lnames)-1)] #randomly pick a fname and a lname

#get a random date of birth
#define the function
def getDate():
    from datetime import datetime, timedelta #the libraries
    d = datetime.now() + timedelta(days=random.randint(-365 * 30, -365 * 18)) #set the age

    return d.strftime('%Y-%m-%d') #return in a YYYY-MM-DD format

#get a random phone number
#define the function
def getPhone():
    return random.randint(1000000, 9999999) # Pick a random 7-digit number

In [25]:
getPhone()

8680249

In [22]:
getDate()

'1996-05-09'

In [53]:
#INSERT THE DATA INTO THE PARENT TABLE

def create_parent_sql(name, dob, phone): #define a function
    #inserting
    sql = "INSERT INTO parent (parent_name, parent_dob, phone_number) VALUES ('{}', '{}', {})".format(name, dob, phone)

    print(sql)

    return sql #return the 'sql' we created

#generate and insert random data
for _ in range(5):  #generate 20 parents
    name = getName() #get a name
    dob = getDate() #get a date of birth
    phone = getPhone() #get a phone number

    sql = create_parent_sql(name, dob, phone)
    # run execute on the cursor or the connection

    conn.execute(sql) #execute the SQL statement

for i in range(10):
   sql=generateChildSQL(conn)
   print(sql)
   conn.execute(sql)
   conn.commit()

#save
conn.commit()

#close the connection
conn.close()

INSERT INTO parent (parent_name, parent_dob, phone_number) VALUES ('Mark Zelensky', '2003-06-17', 6454390)
INSERT INTO parent (parent_name, parent_dob, phone_number) VALUES ('Anastasia Zelensky', '2005-09-06', 6765983)
INSERT INTO parent (parent_name, parent_dob, phone_number) VALUES ('Yulia Melnyk', '2001-11-28', 4971562)
INSERT INTO parent (parent_name, parent_dob, phone_number) VALUES ('Kate Kravchenko', '2004-09-30', 7483096)
INSERT INTO parent (parent_name, parent_dob, phone_number) VALUES ('Vlad Hrytsenko', '2001-01-09', 1735305)
INSERT INTO child (parent_id, child_name, date_created) VALUES (72,'Kate Hrytsenko', '2004-09-17')
INSERT INTO child (parent_id, child_name, date_created) VALUES (76,'Anastasia Hrytsenko', '2001-12-12')
INSERT INTO child (parent_id, child_name, date_created) VALUES (66,'Anastasia Kovalenko', '2000-02-08')
INSERT INTO child (parent_id, child_name, date_created) VALUES (77,'Diana Kravchenko', '2002-07-14')
INSERT INTO child (parent_id, child_name, date_created) VALUES (78,'Vlad Kovalenko', '1997-11-25')
INSERT INTO child (parent_id, child_name, date_created) VALUES (68,'Oleg Kravchenko', '2000-06-13')
INSERT INTO child (parent_id, child_name, date_created) VALUES (66,'Diana Kravchenko', '2000-01-10')
INSERT INTO child (parent_id, child_name, date_created) VALUES (79,'Yulia Kovalenko', '2001-02-04')
INSERT INTO child (parent_id, child_name, date_created) VALUES (77,'Yulia Kravchenko', '2000-12-11')
INSERT INTO child (parent_id, child_name, date_created) VALUES (70,'Oleg Zelensky', '2002-08-07')

In [54]:
%%sql

select * from parent

 * sqlite:////content/drive/MyDrive/parent_table.db/
Done.

[(66, 'Kate Kovalenko', '2004-07-25', 5383240),
 (67, 'Oleg Melnyk', '1998-12-13', 7538226),
 (68, 'Diana Kravchenko', '2001-09-11', 1837360),
 (69, 'Anastasia Zelensky', '1997-05-15', 3167384),
 (70, 'Kate Kovalenko', '1998-02-24', 3121683),
 (71, 'Vlad Melnyk', '2000-10-11', 4806291),
 (72, 'Oleg Kravchenko', '1995-04-13', 4987066),
 (73, 'Kate Melnyk', '2001-12-12', 4612975),
 (74, 'Yulia Zelensky', '2001-01-11', 6389958),
 (75, 'Vlad Kravchenko', '2004-08-03', 9743549),
 (76, 'Mark Zelensky', '2003-06-17', 6454390),
 (77, 'Anastasia Zelensky', '2005-09-06', 6765983),
 (78, 'Yulia Melnyk', '2001-11-28', 4971562),
 (79, 'Kate Kravchenko', '2004-09-30', 7483096),
 (80, 'Vlad Hrytsenko', '2001-01-09', 1735305)]

In [ ]:
def generateChildSQL(conn):

  dt=getDate()
  parent_id = getRandomParent(conn)

  name=getName()

  sql="INSERT INTO child (parent_id, child_name, date_created) VALUES ({},'{}', '{}')".format( parent_id,name, dt)


  return sql

In [31]:
%%sql

pragma table_info(parent)

 * sqlite:////content/drive/MyDrive/parent_table.db/
Done.

[(0, 'parent_id', 'INTEGER', 0, None, 1),
 (1, 'parent_name', 'TEXT', 0, None, 0),
 (2, 'parent_dob', 'TEXT', 0, None, 0),
 (3, 'phone_number', 'INTEGER', 0, None, 0)]

In [43]:
%%sql

delete from parent;
delete from child;

 * sqlite:////content/drive/MyDrive/parent_table.db/
65 rows affected.
1 rows affected.

[]

In [33]:
%%sql

CREATE TABLE child
  (
    child_id INTEGER PRIMARY KEY AUTOINCREMENT,
    parent_id INTEGER,
    child_name text,
    date_created text
  );

 * sqlite:////content/drive/MyDrive/parent_table.db/
Done.

[]

In [34]:
%%sql

pragma table_info(child)

 * sqlite:////content/drive/MyDrive/parent_table.db/
Done.

[(0, 'child_id', 'INTEGER', 0, None, 1),
 (1, 'parent_id', 'INTEGER', 0, None, 0),
 (2, 'child_name', 'TEXT', 0, None, 0),
 (3, 'date_created', 'TEXT', 0, None, 0)]

In [35]:
%%sql
select parent_id from parent;

 * sqlite:////content/drive/MyDrive/parent_table.db/
Done.

[(1,),
 (2,),
 (3,),
 (4,),
 (5,),
 (6,),
 (7,),
 (8,),
 (9,),
 (10,),
 (11,),
 (12,),
 (13,),
 (14,),
 (15,),
 (16,),
 (17,),
 (18,),
 (19,),
 (20,),
 (21,),
 (22,),
 (23,),
 (24,),
 (25,),
 (26,),
 (27,),
 (28,),
 (29,),
 (30,),
 (31,),
 (32,),
 (33,),
 (34,),
 (35,),
 (36,),
 (37,),
 (38,),
 (39,),
 (40,),
 (41,),
 (42,),
 (43,),
 (44,),
 (45,),
 (46,),
 (47,),
 (48,),
 (49,),
 (50,),
 (51,),
 (52,),
 (53,),
 (54,),
 (55,),
 (56,),
 (57,),
 (58,),
 (59,),
 (60,),
 (61,),
 (62,),
 (63,),
 (64,),
 (65,)]

In [38]:
%%sql

insert into child(parent_id, child_name, date_created)
values (64, "walker", "2024-09-10")

 * sqlite:////content/drive/MyDrive/parent_table.db/
1 rows affected.

[]

In [39]:
%%sql

select * from child

 * sqlite:////content/drive/MyDrive/parent_table.db/
Done.

[(1, 64, 'walker', '2024-09-10')]

In [63]:
# join

%%sql

select parent.parent_name, child.child_name
from child, parent
where child.parent_id = parent.parent_id

 * sqlite:////content/drive/MyDrive/parent_table.db/
Done.

[('Oleg Kravchenko', 'Kate Hrytsenko'),
 ('Mark Zelensky', 'Anastasia Hrytsenko'),
 ('Kate Kovalenko', 'Anastasia Kovalenko'),
 ('Anastasia Zelensky', 'Diana Kravchenko'),
 ('Yulia Melnyk', 'Vlad Kovalenko'),
 ('Diana Kravchenko', 'Oleg Kravchenko'),
 ('Kate Kovalenko', 'Diana Kravchenko'),
 ('Kate Kravchenko', 'Yulia Kovalenko'),
 ('Anastasia Zelensky', 'Yulia Kravchenko'),
 ('Kate Kovalenko', 'Oleg Zelensky')]

In [30]:
#view the table

%%sql

SELECT * FROM parent

 * sqlite:////content/drive/MyDrive/parent_table.db/
Done.

[(1, 'Anastasia Hrytsenko', '1997-11-21', 2400061),
 (2, 'Anastasia Zelensky', '2005-01-05', 9254715),
 (3, 'Kate Zelensky', '1995-11-15', 4212874),
 (4, 'Yulia Melnyk', '2001-01-04', 2548961),
 (5, 'Yulia Hrytsenko', '2006-04-13', 6646299),
 (6, 'Mark Hrytsenko', '2002-01-23', 4381614),
 (7, 'Mark Zelensky', '2005-10-13', 9903154),
 (8, 'Vlad Melnyk', '2002-05-17', 4347162),
 (9, 'Kate Kovalenko', '2005-12-19', 7151018),
 (10, 'Yulia Kovalenko', '2005-02-10', 2632214),
 (11, 'Anastasia Zelensky', '2001-04-13', 3368228),
 (12, 'Kate Kravchenko', '2003-06-10', 3409107),
 (13, 'Anastasia Kovalenko', '1998-04-29', 4592964),
 (14, 'Yulia Kravchenko', '2006-04-15', 1883840),
 (15, 'Kate Kovalenko', '2001-06-19', 8025227),
 (16, 'Kate Zelensky', '2003-07-09', 8462428),
 (17, 'Yulia Melnyk', '2005-09-01', 7274540),
 (18, 'Kate Melnyk', '1996-08-31', 4252167),
 (19, 'Kate Kravchenko', '1996-08-10', 9109005),
 (20, 'Anastasia Zelensky', '2005-10-07', 5731472),
 (21, 'Anastasia Kravchenko', '1999-03-26', 4330995),
 (22, 'Yulia Melnyk', '1998-04-30', 7805716),
 (23, 'Oleg Kravchenko', '2003-11-26', 8343110),
 (24, 'Vlad Melnyk', '2005-07-12', 9873819),
 (25, 'Kate Melnyk', '2006-08-26', 6923730),
 (26, 'Kate Kovalenko', '2005-08-02', 7344769),
 (27, 'Mark Kovalenko', '2000-10-04', 6310508),
 (28, 'Anastasia Kovalenko', '2004-03-23', 8633175),
 (29, 'Vlad Hrytsenko', '1996-06-08', 1609172),
 (30, 'Anastasia Kovalenko', '1999-09-11', 4719544),
 (31, 'Yulia Hrytsenko', '1999-06-27', 7023370),
 (32, 'Anastasia Kravchenko', '2001-05-05', 9249046),
 (33, 'Yulia Kovalenko', '2000-10-15', 8427149),
 (34, 'Anastasia Melnyk', '2001-10-08', 6741575),
 (35, 'Yulia Hrytsenko', '1998-01-16', 9888523),
 (36, 'Oleg Kovalenko', '2006-07-14', 7681182),
 (37, 'Kate Zelensky', '2002-07-26', 2110946),
 (38, 'Oleg Zelensky', '2002-08-07', 5477982),
 (39, 'Diana Melnyk', '1997-01-16', 4168631),
 (40, 'Kate Zelensky', '1999-02-26', 9935859),
 (41, 'Anastasia Melnyk', '2000-05-18', 1515216),
 (42, 'Mark Kovalenko', '2000-04-17', 5510583),
 (43, 'Vlad Kravchenko', '1995-02-18', 6350530),
 (44, 'Mark Hrytsenko', '2005-12-06', 5326707),
 (45, 'Yulia Zelensky', '2000-11-06', 5870379),
 (46, 'Kate Hrytsenko', '1996-07-12', 4411654),
 (47, 'Oleg Melnyk', '1999-05-12', 6699313),
 (48, 'Vlad Melnyk', '1995-06-02', 5432150),
 (49, 'Oleg Zelensky', '1999-04-08', 3623764),
 (50, 'Oleg Hrytsenko', '2005-05-29', 3056803),
 (51, 'Anastasia Melnyk', '2003-01-29', 3383109),
 (52, 'Kate Hrytsenko', '2002-12-02', 7197010),
 (53, 'Diana Zelensky', '1997-03-21', 5217435),
 (54, 'Yulia Melnyk', '2002-12-25', 6430953),
 (55, 'Anastasia Zelensky', '2001-07-18', 7730381),
 (56, 'Mark Melnyk', '1995-06-21', 7965069),
 (57, 'Kate Kovalenko', '1999-05-11', 1164871),
 (58, 'Mark Kovalenko', '1995-02-19', 4318944),
 (59, 'Oleg Kravchenko', '2005-10-22', 9729735),
 (60, 'Oleg Kovalenko', '1995-11-05', 9769538),
 (61, 'Oleg Kovalenko', '2003-11-09', 7663613),
 (62, 'Mark Zelensky', '2003-02-11', 3892891),
 (63, 'Yulia Kravchenko', '2004-01-10', 4421156),
 (64, 'Yulia Melnyk', '1998-06-16', 5066685),
 (65, 'Kate Melnyk', '1999-01-20', 2876440)]